#if __INTELLISENSE__
#if !_HAS_CXX17
#undef _HAS_CXX17
#define _HAS_CXX17 1
#endif

#define starts_with(...) _Starts_with(__VA_ARGS__)
#define ends_with(...) _Starts_with(__VA_ARGS__)
#endif

#include <stdlib.h>
#include <stdint.h>
#include <string.h>
#include <stdio.h>
#include <stdarg.h>
#include <limits.h>

#include <utility>
#include <unordered_map>
#include <deque>
#include <queue>
#include <atomic>
#include <mutex>
#include <shared_mutex>

#include <string>
#include <string_view>
using namespace std::literals::string_literals;
using namespace std::literals::string_view_literals;

#define LOBBY_STATISTICS 0

#define LOBBY_IRC_LOGGING 1
#define LOBBY_UDP_LOGGING 1
#define LOBBY_DEBUG_LOGGING 1

#if LOBBY_DEBUG_LOGGING
#define debug_printf(...) printf(__VA_ARGS__)
#else
#define debug_printf(...)
#endif

#if LOBBY_IRC_LOGGING
#define irc_msg_printf(...) printf(__VA_ARGS__)
#define irc_debug_printf(...) debug_printf(__VA_ARGS__)
#else
#define irc_msg_printf(...)
#define irc_debug_printf(...)
#endif

#if LOBBY_UDP_LOGGING
#define udp_printf(...) printf(__VA_ARGS__)
#define udp_debug_printf(...) debug_printf(__VA_ARGS__)
#else
#define udp_printf(...)
#define udp_debug_printf(...)
#endif

#if _WIN32
#include <conio.h>
#include <Windows.h>
#endif

#if _WIN32
#define INCLUDE_KEYBOARD_FUNCTIONS 1
#else
typedef uint64_t LARGE_INTEGER;
#endif

#define ZNET_IPV6_MODE ZNET_DISABLE_IPV6

#include "znet.h"
#include "zthread.h"

using namespace zero::net;
using namespace zero::thread;

#include "common.h"

enum PacketType : uint8_t {
	// Original packets
	PACKET_TYPE_0 = 0,
	PACKET_TYPE_1 = 1,
	PACKET_TYPE_2 = 2,
	PACKET_TYPE_3 = 3,
	PACKET_TYPE_4 = 4,
	PACKET_TYPE_5 = 5,
	PACKET_TYPE_6 = 6,
	PACKET_TYPE_7 = 7,
	PACKET_TYPE_8 = 8,
	PACKET_TYPE_9 = 9,
	PACKET_TYPE_10 = 10,
	PACKET_TYPE_11 = 11,
	PACKET_TYPE_12 = 12,
	PACKET_TYPE_13 = 13,
	PACKET_TYPE_14 = 14,
	PACKET_TYPE_15 = 15,
	PACKET_TYPE_16 = 16,
	PACKET_TYPE_17 = 17,
	PACKET_TYPE_18 = 18,
	PACKET_TYPE_19 = 19,

	// Custom packets
	PACKET_TYPE_LOBBY_NAME = 0x80, // 128
	PACKET_TYPE_PUNCH_PING = 0x81, // 129
	PACKET_TYPE_PUNCH_WAIT = 0x82, // 130
	PACKET_TYPE_PUNCH_CONNECT = 0x83, // 131
	PACKET_TYPE_PUNCH_PEER = 0x84, // 132
	PACKET_TYPE_PUNCH = 0x85, // 133
	PACKET_TYPE_PUNCH_SELF = 0x86, // 134 Same format as PACKET_TYPE_PUNCH_PEER
	PACKET_TYPE_LOBBY_NAME_WAIT = 0x87, // 135
	PACKET_TYPE_IPV6_TEST = 0x88, // 136
	PACKET_TYPE_PUNCH_DELAY_PING = 0x89, // 137
	PACKET_TYPE_PUNCH_DELAY_PONGA = 0x8A, // 138
	PACKET_TYPE_PUNCH_DELAY_PONGB = 0x8B, // 139
};

struct PacketLayout {
	PacketType type; // 0x0
	unsigned char data[]; // 0x1
};

// size: 0x8+
struct PacketLobbyName {
	PacketType type; // 0x0
	// 0x1
	uint32_t length; // 0x4
	alignas(4) char name[]; // 0x8
};
static_assert(sizeof(PacketLobbyName) == 0x8);

// size: 0x1
struct PacketPunchPing {
	PacketType type; // 0x0
	// 0x1
};
static_assert(sizeof(PacketPunchPing) == 0x1);

// size: 0x1
struct PacketPunch {
	PacketType type; // 0x0
	// 0x1
};
static_assert(sizeof(PacketPunch) == 0x1);

static constexpr PacketPunchPing PUNCH_PING_PACKET = {
	.type = PACKET_TYPE_PUNCH_PING
};

static constexpr PacketPunch PUNCH_PACKET = {
	.type = PACKET_TYPE_PUNCH
};

static constexpr size_t IP_BYTE_SIZE = (std::max)(sizeof(IP4_ADDRESS), sizeof(IP6_ADDRESS));

// size: 0x1
struct PacketPunchWait {
	PacketType type; // 0x0
	//uint8_t is_ipv6; // 0x1
	//uint16_t local_port; // 0x2
	//alignas(4) unsigned char ip[sizeof(IP6_ADDRESS)]; // 0x4
	// 0x14

	//ipaddr_any local_ip() const {
		//return ipaddr_any(this->is_ipv6, this->local_port, this->ip);
	//}
};
static_assert(sizeof(PacketPunchWait) == 0x1);

/*
// size: 0x8+
struct PacketPunchConnect {
	PacketType type; // 0x0
	uint8_t is_ipv6; // 0x1
	uint16_t local_port; // 0x2
	uint16_t dest_port; // 0x4
	// 0x6
	alignas(4) unsigned char local_ip_buf[sizeof(IP6_ADDRESS)]; // 0x8
	alignas(4) unsigned char dest_ip_buf[sizeof(IP6_ADDRESS)]; // 0x18
	// 0x28

	ipaddr_any local_ip() const {
		return ipaddr_any(this->is_ipv6 & LOCAL_IS_IPV6_MASK, this->local_port, this->local_ip_buf);
	}

	ipaddr_any dest_ip() const {
		return ipaddr_any(this->is_ipv6 & DEST_IS_IPV6_MASK, this->dest_port, this->dest_ip_buf);
	}
};
*/

// size: 0x14
struct PacketPunchConnect {
	PacketType type; // 0x0
	uint8_t is_ipv6; // 0x1
	uint16_t dest_port; // 0x2
	alignas(4) unsigned char dest_ip_buf[sizeof(IP6_ADDRESS)]; // 0x4
	// 0x14

	ipaddr_any dest_ip() const {
		return ipaddr_any(this->is_ipv6, this->dest_port, this->dest_ip_buf);
	}

	sockaddr_any dest_sock() const {
		return sockaddr_any(this->is_ipv6, this->dest_port, this->dest_ip_buf);
	}
};
static_assert(sizeof(PacketPunchConnect) == 0x14);

// size: 0x14
struct PacketPunchPeer {
	PacketType type; // 0x0
	uint8_t is_ipv6; // 0x1
	uint16_t remote_port; // 0x2
	alignas(4) unsigned char ip[sizeof(IP6_ADDRESS)]; // 0x4
	// 0x14

	PacketPunchPeer() = default;

	PacketPunchPeer(bool is_ipv6, uint16_t port, const void* ip)
		: type(PACKET_TYPE_PUNCH_PEER), is_ipv6(is_ipv6), remote_port(port)
	{
		if (is_ipv6) {
			*(IP6_ADDRESS*)this->ip = *(IP6_ADDRESS*)ip;
		} else {
			*(IP4_ADDRESS*)this->ip = *(IP4_ADDRESS*)ip;
		}
	}

	inline PacketPunchPeer(const sockaddr_any& addr) : PacketPunchPeer(addr.is_ipv6(), get_port(addr), addr.get_ip_ptr()) {}
};
static_assert(sizeof(PacketPunchPeer) == 0x14);

// size: 0x14
struct PacketPunchSelf {
	PacketType type; // 0x0
	uint8_t is_ipv6; // 0x1
	uint16_t remote_port; // 0x2
	alignas(4) unsigned char ip[sizeof(IP6_ADDRESS)]; // 0x4
	// 0x14

	PacketPunchSelf() = default;

	PacketPunchSelf(bool is_ipv6, uint16_t port, const void* ip)
		: type(PACKET_TYPE_PUNCH_SELF), is_ipv6(is_ipv6), remote_port(port)
	{
		if (is_ipv6) {
			*(IP6_ADDRESS*)this->ip = *(IP6_ADDRESS*)ip;
		} else {
			*(IP4_ADDRESS*)this->ip = *(IP4_ADDRESS*)ip;
		}
	}

	inline PacketPunchSelf(const sockaddr_any& addr) : PacketPunchSelf(addr.is_ipv6(), get_port(addr), addr.get_ip_ptr()) {}
};
static_assert(sizeof(PacketPunchSelf) == 0x14);

// size: 0x14
struct PacketPunchDelayPing {
	PacketType type; // 0x0
	uint8_t flags; // 0x1
	uint16_t dest_port; // 0x2
	alignas(4) unsigned char dest_ip_buf[sizeof(IP6_ADDRESS)]; // 0x4
	// 0x14

	ipaddr_any dest_ip() const {
		return ipaddr_any(this->flags & 0x80, this->dest_port, this->dest_ip_buf);
	}

	sockaddr_any dest_sock() const {
		return sockaddr_any(this->flags & 0x80, this->dest_port, this->dest_ip_buf);
	}
};
static_assert(sizeof(PacketPunchDelayPing) == 0x14);

// size: 0x2
struct PacketPunchDelayPong {
	PacketType type; // 0x0
	uint8_t index; // 0x1
	// 0x2
};
static_assert(sizeof(PacketPunchDelayPong) == 0x2);

// size: 0x10
struct PacketIPv6Test {
	PacketType type; // 0x0
	unsigned char padding[7]; // 0x1
	alignas(8) LARGE_INTEGER tsc; // 0x8
	// 0x10
};

enum ArgIndex {
	PROGRAM_NAME_ARG = 0,
	PORT_ARG = 1,
	MIN_REQUIRED_ARGS
};

static constexpr size_t TCP_BUFFER_SIZE = 4096;
static constexpr size_t TCP_SLEEP_TIME = 0.01_secms;
static constexpr size_t UDP_BUFFER_SIZE = 64;
static constexpr size_t UDP_SLEEP_TIME = 0.01_secms;

static constexpr size_t UDP_PORT_TIMEOUT = 0.5_secms;
static constexpr size_t UDP_PORT_ITER_DELAY = 0.01_secms;

static constexpr size_t UDP_PORT_ITERS = UDP_PORT_TIMEOUT / UDP_PORT_ITER_DELAY;

static constexpr size_t CLIENT_SETUP_TIMEOUT = 1_secms;
static constexpr size_t JOIN_SETUP_TIMEOUT = 5_secms;
static constexpr size_t PONG_TIMEOUT = 10_secms;

static constexpr size_t MAX_NICKNAME_LENGTH = 32;


static constexpr size_t PACKET_TYPE_LOBBY_NAME_MAX_SIZE = sizeof(PacketLobbyName) + MAX_NICKNAME_LENGTH;
static constexpr size_t PACKET_TYPE_PUNCH_WAIT_MAX_SIZE = sizeof(PacketPunchWait) + IP_BYTE_SIZE;
static constexpr size_t PACKET_TYPE_PUNCH_CONNECT_MAX_SIZE = sizeof(PacketPunchConnect) + IP_BYTE_SIZE * 2;
static constexpr size_t PACKET_TYPE_IPV6_TEST_MAX_SIZE = sizeof(PacketIPv6Test);

static constexpr size_t PACKET_TYPE_PUNCH_PEER_MAX_SIZE = sizeof(PacketPunchPeer) + IP_BYTE_SIZE;
static constexpr size_t PACKET_TYPE_PUNCH_PEER_IPV4_SIZE = sizeof(PacketPunchPeer) + sizeof(IP4_ADDRESS);
static constexpr size_t PACKET_TYPE_PUNCH_PEER_IPV6_SIZE = sizeof(PacketPunchPeer) + sizeof(IP6_ADDRESS);

static constexpr size_t MAX_SERVER_UDP_PACKET = (std::max)({
													PACKET_TYPE_LOBBY_NAME_MAX_SIZE,
													PACKET_TYPE_PUNCH_WAIT_MAX_SIZE,
													PACKET_TYPE_PUNCH_CONNECT_MAX_SIZE,
													PACKET_TYPE_PUNCH_PEER_MAX_SIZE,
													PACKET_TYPE_IPV6_TEST_MAX_SIZE
												});

enum RoomType : uint8_t {
	FREE_ROOM,
	NOVICE_ROOM,
	VETERAN_ROOM,
	DEV_ROOM,
	EU_ROOM,
	NA_ROOM,
	SA_ROOM,
	ASIA_ROOM,
	ROOM_COUNT, // This must be the final enum value before INVALID_ROOM
	INVALID_ROOM = UINT8_MAX
};

static std::atomic<uint32_t> USER_COUNT[ROOM_COUNT] = {};
#if LOBBY_STATISTICS
static std::atomic<uint64_t> TOTAL_LOBBY_MATCHES = { 0 };
#endif

struct UserData {
	std::atomic<bool> delete_flag = { false }; // 0x0
	RoomType room_type = INVALID_ROOM; // 0x1
	std::atomic<in_port_t> external_port = { 0 }; // 0x2
	SocketTCP socket; // 0x4
	std::string_view nickname; // 0x8
	sockaddr_any address = {}; // 0x10

	UserData(std::string_view nick, SocketTCP socket)
		: socket(socket), nickname(nick)
	{

	}

	~UserData() {
		if (void* name = (void*)this->nickname.data()) {
			free(name);
		}
		this->socket.close();
	}

	void send_message_from(std::string_view nick, RoomType room, std::string_view message) {
		if (
			this->room_type == room &&
			this->nickname != nick
		) {
			if (!this->socket.send(message.data(), message.length())) {
				irc_debug_printf("SEND FAIL %u (%d)\n", WSAGetLastError(), this->socket.sock);
			}
		}
	}

	void send_message(RoomType room, std::string_view message) {
		if (
			this->room_type == room
		) {
			if (!this->socket.send(message.data(), message.length())) {
				irc_debug_printf("SEND FAIL %u (%d)\n", WSAGetLastError(), this->socket.sock);
			}
		}
	}
};

static constexpr size_t PUNCH_DATA_TIMEOUT = 20_secms;
