#include <cstdint>
#if __INTELLISENSE__
#undef _HAS_CXX20
#define _HAS_CXX20 0
#endif

#include <d3d11.h>
#include <vector>
#include <memory>
#include <list>

#include "config.h"
#include "log.h"
#include "squirrel.h"
#include "util.h"
#include "overlay.h"

static constexpr uint8_t hitbox_vert_cso[] = {
#include "shaders/hitbox_vert.cso.h"
};
static constexpr uint8_t hitbox_frag_cso[] = {
#include "shaders/hitbox_frag.cso.h"
};

#define MAX_HITBOXES 1024

struct btVector3;

#define d3d11_dev ((ID3D11Device**)0x4DAE9C_R)
#define d3d11_imm ((ID3D11DeviceContext**)0x4DAE98_R)
#define btBox2dShape_getHalfExtentsWithMargin ((btVector3* (*thiscall)(btCollisionShape*, btVector3*))0x1C0EB0_R)
//#define draw_rect ((void (vectorcall*)(const float*, float, float, float, float))0x39600_R)

typedef struct _D3DMATRIX {
    /*
    union {
        struct {
            float _11, _12, _13, _14;
            float _21, _22, _23, _24;
            float _31, _32, _33, _34;
            float _41, _42, _43, _44;
        };
        float m[4][4];
    };
    */
    vec<float, 4> m[4];
} D3DMATRIX;

// TODO: Move this stuff to its own header. It might be useful for rollback too
struct SqratObject {
    char dont_care0[0x14]; // 0x0
    // 0x14
};

static_assert(sizeof(SqratObject) == 0x14);

struct SqratFunction {
    char dont_care0[0x14]; // 0x0
    // 0x14
};

static_assert(sizeof(SqratFunction) == 0x14);

// Bullet's Vector3 actually has 4 elements because of SIMD
struct alignas(16) btVector3 {
    //float v[4];
    vec<float, 4, true> v;
};

static_assert(sizeof(btVector3) == 0x10);

struct btMatrix3x3 {
    btVector3 m[3];
};

static_assert(sizeof(btMatrix3x3) == 0x30);

struct btTransform {
    btMatrix3x3 basis;
    btVector3 origin;
};

static_assert(sizeof(btTransform) == 0x40);

struct btCollisionShape {
    // TODO: Make vtable explicit instead of trusting compiler with function order
    virtual void unk0();
    virtual void getAabb(btTransform* t, btVector3* aabbMin, btVector3* aabbMax);

    // void* vtbl // 0x0
    uint32_t shape; // 0x4
    // 0x8, unknown total size
};

struct btBroadphaseProxy {
    void* m_clientObject;
    uint16_t m_collisionFilterGroup;
    uint16_t m_collisionFilterMask;
};

struct btGhostObject {
    char __unk0[0x10]; // 0x0
    btTransform m_worldTransform; // 0x10
    char __unk50[0xC8 - 0x50]; // 0x50
    btBroadphaseProxy* m_broadphaseProxy; // 0xC8
    btCollisionShape* m_collisionShape; // 0xCC
    char __unkD0[8]; // 0xD0
    uint32_t m_collisionFlags; // 0xD8
    char __unkDC[0x280 - 0xDC]; // 0xDC
    // 0x280
};

static_assert(sizeof(btGhostObject) == 0x280);

template<typename T>
struct btAlignedObjectArray {
    size_t m_size; // 0x0
    size_t m_capacity; // 0x4
    T* m_data; // 0x8
    bool m_ownsMemory; // 0xC
    // 0x10
};

static_assert(sizeof(btAlignedObjectArray<void>) == 0x10);

struct btCollisionWorld {
    void* vtbl; // 0x0
    char __unk4[4]; // 0x4
    btAlignedObjectArray<btGhostObject*> m_collisionObjects; // 0x8
    char __unk18[0x150 - 0x18]; // 0x18 
};

static_assert(sizeof(btCollisionWorld) == 0x150);

struct ManbowWorld2D {
    char __unk0[0x20]; // 0x0
    btCollisionWorld* bullet_world; // 0x20
    char __unk24[8]; // 0x24
    // 0x2C
};

static_assert(sizeof(ManbowWorld2D) == 0x2C);

struct ManbowActorCollisionData {
    char __unk0[0xC]; // 0x0
    btGhostObject* obj_ptr; // 0xC
    btGhostObject obj; // 0x10
};

struct Unk130 {
    char            __unk0[0xC]; // 0x0
    uint32_t        __unkc; // 0xc
};

struct TakeData {
    char            __unk0[0xc]; // 0x0
    TakeData*       previous; // 0x4
    TakeData*       next; // 0x8
    uint32_t        __unkc; // 0xc
    int32_t        frame_total; // 0x10
};

// struct IAnimationTake;

// struct Actor2DTakeData;

struct AnimationNode {
    void*           __unk0; // 0x0 
    AnimationNode*  next; // 0x4 <
    AnimationNode*  previous; // 0x8
    char            __unkC; // 0xC
    bool            __unkD; // 0xD
    char            __pad[0x2]; // 0xE
    int32_t         __unk10; // 0x10
    TakeData*          __unk14; // 0x14
};

struct AnimationSet2D {
    void*           vtbl; // 0x0
    void*           __unk4; // 0x4
    AnimationNode*  head; // 0x8 <
};

// size: 0x120
struct ManbowAnimationControllerBase {
    void* vftable; // 0x0
    char __unk4[0x18]; // 0x4
    uint32_t motion; // 0x1c
    int32_t key_take; // 0x20
    uint32_t keyframe; // 0x24
    float red; // 0x28
    float green; // 0x2C
    float blue; // 0x30
    float alpha; // 0x34
    D3DMATRIX __matrix_38; // 0x38
    std::vector<std::shared_ptr<ManbowActorCollisionData>> collision_boxes; // 0x78
    std::vector<std::shared_ptr<ManbowActorCollisionData>> hit_boxes; // 0x84
    std::vector<std::shared_ptr<ManbowActorCollisionData>> hurt_boxes; // 0x90
    char __unk9C[0x84]; // 0x9C
    // 0x120
};

// size: 0x230
struct ManbowAnimationController2D : ManbowAnimationControllerBase {
    // ManbowAnimationControllerBase base; // 0x0
    void* tf4_imaterial_vftable; // 0x120 (this probably does nothing)
    AnimationSet2D* anim_set;// 0x124
    void* __unk128; // 0x128
    TakeData* take; // 0x12C
    Unk130* __unk130; // 0x130
    int32_t __unk134; // 0x134
    uint32_t current_frame; // 0x138
    char __unk13C[0x224 - 0x13C]; // 0x13C
    std::vector<std::shared_ptr<TakeData>> __unk224; // 0x224
    // 0x230
};

static_assert(sizeof(ManbowAnimationController2D) == 0x230); //something is not alligned by 4 bytes

// size: 0x268
struct ManbowAnimationController3D : ManbowAnimationControllerBase {
    // ManbowAnimationControllerBase base; // 0x0
    char __unk120[0x148]; // 0x120
    // 0x268
};

// size: 0x280
struct ManbowAnimationControllerDynamic : ManbowAnimationController2D {
    // ManbowAnimationController2D base; // 0x0
    char __unk230[0x50]; // 0x230
    // 0x280
};

// size: 0x240
struct ManbowAnimationControllerStencil : ManbowAnimationController2D {
    // ManbowAnimationController2D base; // 0x0
    char __unk230[0x10]; // 0x230
    // 0x240
};

// size: 0x300
struct ManbowAnimationControllerTrail : ManbowAnimationController2D {
    // ManbowAnimationController2D base; // 0x0
    char __unk230[0xD0]; // 0x230
    // 0x300
};

struct ManbowCamera2D {
    char dont_care0[0x1C]; // 0x0
    D3DMATRIX view_proj_matrix; // 0x1C
    D3DMATRIX view_matrix; // 0x5C
    D3DMATRIX proj_matrix; // 0x9C
    char dont_care9C[0x134 - 0xDC]; // 0xDC
    // 0x134
};

static_assert(sizeof(ManbowCamera2D) == 0x134);

struct ManbowActor2DGroup;

struct ManbowActor2D {
    void* vtbl; // 0x0
    char __unk4[8]; // 0x4
    float pos[3]; // 0xC
    int32_t id; // 0x18
    float left; // 0x1C
    float top; // 0x20
    float right; // 0x24
    float bottom; // 0x28
    float vx; // 0x2C
    float vy; // 0x30
    char __unk34[4]; // 0x34
    float direction; // 0x38
    std::shared_ptr<ManbowAnimationController2D> anim_controller; // 0x3C
    char __unk44[4]; // 0x44
    float ox; // 0x48
    float oy; // 0x4C
    float s[3]; // 0x50, skew???
    float r[3]; // 0x5C, rotation???
    void* /* Manbow::Actor2DManager* */ actor2d_mgr; // 0x68
    ManbowActor2DGroup* actor2d_group; // 0x6C
    uint8_t active_flags; // 0x70
    char probably_padding[3]; // 0x71
    SQObject sq_obj; // 0x74
    uint32_t collision_group; // 0x7C
    uint32_t collision_mask; // 0x80
    uint32_t callback_group; // 0x84
    uint32_t callback_mask; // 0x88
    float hitLeft; // 0x8C
    float hitTop; // 0x90
    float hitRight; // 0x94
    float hitBottom; // 0x98
    char __unk9C[0xC]; // 0x9C
    SqratFunction update_func; // 0xA8
    SqratFunction __sqrat_funcBC; // 0xBC
    char __unkD0[8]; // 0xD0
    void* __ptrD8; // 0xD8
    uint32_t group_flags; // 0xDC
    uint32_t list_idx; // 0xE0
    uint32_t __uintE4; // 0xE4
    uint32_t __id2; // 0xE8
    // 0xEC
};

static_assert(sizeof(ManbowActor2D) == 0xEC);

struct ManbowActor2DGroup {
    void* vtbl; // 0x0
    std::shared_ptr<ManbowActor2DGroup> __shared_ptr4; // 0x4
    std::list<std::shared_ptr<ManbowActor2D>> actor_list; // 0xC
    std::vector<ManbowActor2D*> actor_vec; // 0x14
    uint32_t size; // 0x20
    uint32_t update_mask; // 0x24
    bool pending_release; // 0x28
    char probably_padding[3]; // 0x29
    char __unk2C[0xC]; // 0x2C
    std::shared_ptr<ManbowWorld2D> world; // 0x38
    SqratFunction on_hit_collision; // 0x40
    SqratFunction on_hit_actor; // 0x54
    SqratFunction on_move; // 0x68
    char __unk7C[4]; // 0x7C
    SqratObject camera_obj; // 0x80
    ManbowCamera2D* camera; // 0x94
    void (thiscall *update_func)(ManbowActor2DGroup*); // 0x98
    // 0x9C
};

static_assert(sizeof(ManbowActor2DGroup) == 0x9C);

enum DrawType : uint8_t {
    DRAW_RECT,
    DRAW_CIRCLE,
};

struct DrawObj {
    DrawType prim;
    uint16_t group;
    union {
        union {
            float points[2 * 4];
            vec<float, 4> points_vec[2];
        } rect;
        union {
            float aabb[2 * 2];
            vec<float, 4> aabb_vec;
        } circle;
    };

    // This avoids calling memset when resizing vectors
    inline DrawObj() {}
};

struct HitboxVertex {
    float pos[2];
};

// Constant buffer sizes have to be 16-byte aligned
struct alignas(16) HitboxConstantBuffer {
    float alphas[2];
};

struct HitboxGPUData {
    uint32_t col;
    uint32_t flags;
    float thresholds[2];
};

static bool overlay_supported = true;

static ID3D11VertexShader* hitbox_vs = nullptr;
static ID3D11PixelShader* hitbox_ps = nullptr;
