#pragma once

#ifndef ZNET_H
#define ZNET_H 1

#define NOMINMAX 1

// These types aren't even used in the code
// but clang is warning about them anyway
#define _WINSOCK_DEPRECATED_NO_WARNINGS 1

#include <stdlib.h>
#include <stdint.h>
#include <string.h>
#include <stdio.h>
#include <wchar.h>

#include <vector>
#include <unordered_map>
#include <mutex>
#include <shared_mutex>
#include <thread>
#include <atomic>
#include <utility>
#include <type_traits>
#include <bit>
#include <atomic>
#include <string>
#include <string_view>
#include <functional>

#if _WIN32
#ifndef ZNET_SUPPORT_WCHAR
#define ZNET_SUPPORT_WCHAR 1
#endif

#define ENABLE_SSL 0

#include <WinSock2.h>
#include <WS2tcpip.h>
#include <MSWSock.h>

#if ENABLE_SSL
#define SECURITY_WIN32
#include <security.h>
#include <schannel.h>
#include <sspi.h>
#endif

#include <windows.h>

#include <WinDNS.h>

typedef int socklen_t;
typedef uint16_t sa_family_t;
typedef uint16_t in_port_t;
#else

#define ENABLE_SSL 0
#include <errno.h>
#include <unistd.h>
#include <sys/types.h>
#include <sys/time.h>
#include <sys/ioctl.h>
#include <fcntl.h>
#include <sys/socket.h>
#include <netinet/in.h>
#include <netinet/ip.h>
#include <arpa/inet.h>
#include <netdb.h>

typedef int SOCKET;
typedef struct addrinfo ADDRINFOA;
typedef in_addr_t IP4_ADDRESS;
typedef union {
    uint32_t IP6Dword[4];
    uint16_t IP6Word[8];
} IP6_ADDRESS;
#define INVALID_SOCKET (~((SOCKET)0))
#define WSAGetLastError() errno
#endif

using usocklen_t = std::make_unsigned_t<socklen_t>;

#include "common.h"

#if _WIN32
#pragma comment (lib, "Ws2_32.lib")
#pragma comment (lib, "Dnsapi")
#if ENABLE_SSL
#pragma comment (lib, "secur32.lib")
#endif
#endif

namespace zero {

namespace util {
template <typename T>
using SIForSize = std::conditional_t<sizeof(T) == sizeof(int8_t), int8_t,
                  std::conditional_t<sizeof(T) == sizeof(int16_t), int16_t,
                  std::conditional_t<sizeof(T) == sizeof(int32_t), int32_t,
                  std::conditional_t<sizeof(T) == sizeof(int64_t), int64_t,
                  void>>>>;

template <typename T>
using UIForSize = std::conditional_t<sizeof(T) == sizeof(uint8_t), uint8_t,
                  std::conditional_t<sizeof(T) == sizeof(uint16_t), uint16_t,
                  std::conditional_t<sizeof(T) == sizeof(uint32_t), uint32_t,
                  std::conditional_t<sizeof(T) == sizeof(uint64_t), uint64_t,
                  void>>>>;

template <typename T>
static constexpr UIForSize<T> bit_cast_from_size(T value) {
    return std::bit_cast<UIForSize<T>>(value);
}

template <typename T>
static constexpr T bit_cast_to_size(UIForSize<T> value) {
    return std::bit_cast<T>(value);
}

template <typename T>
static constexpr T bswap(T value) {
    auto temp = bit_cast_from_size<T>(value);
    if constexpr (sizeof(T) == sizeof(uint16_t)) {
        temp = __builtin_bswap16(temp);
    }
    else if constexpr (sizeof(T) == sizeof(uint32_t)) {
        temp = __builtin_bswap32(temp);
    }
    else if constexpr (sizeof(T) == sizeof(uint64_t)) {
        temp = __builtin_bswap64(temp);
    }
    return bit_cast_to_size<T>(temp);
}

}

namespace net {

template<typename T>
static inline constexpr T hton(T value) {
    if constexpr (std::endian::native == std::endian::little) {
        return util::bswap(value);
    }
    else if constexpr (std::endian::native == std::endian::big) {
        return value;
    }
    else {
        static_assert(false);
    }
}

template<typename T>
static inline constexpr T ntoh(T value) {
    if constexpr (std::endian::native == std::endian::little) {
        return util::bswap(value);
    }
    else if constexpr (std::endian::native == std::endian::big) {
        return value;
    }
    else {
        static_assert(false);
    }
}

#if ZNET_SUPPORT_WCHAR
#define ZNET_WCHAR_TEST(type) do; while(0)
#else
#define ZNET_WCHAR_TEST(type) if constexpr (std::is_same_v<type, wchar_t>) { static_assert(false, "Wide characters are not supported"); }
#endif

#define ZNET_REQUIRE_IPV6       0b001
#define ZNET_DONT_REQUIRE_IPV6  0b010
#define ZNET_DISABLE_IPV6       0b100

#ifndef ZNET_IPV6_MODE
#define ZNET_IPV6_MODE ZNET_DONT_REQUIRE_IPV6
#endif

#define ZNET_IPV6_MODES(mask) ((ZNET_IPV6_MODE) & (mask))

#if ZNET_IPV6_MODES(ZNET_REQUIRE_IPV6)
static inline constexpr bool enable_ipv6 = true;
#endif
#if ZNET_IPV6_MODES(ZNET_DONT_REQUIRE_IPV6)
#if _WIN32
static inline bool enable_ipv6 = false;
#else
static inline bool enable_ipv6 = true;
#endif
#endif
#if ZNET_IPV6_MODES(ZNET_DISABLE_IPV6)
static inline constexpr bool enable_ipv6 = false;
#endif

enum IPType : uint8_t {
    IPv4,
    IPv6
};

// size: 0x20
struct IPv4Header {
    union {
        uint8_t first_byte; // 0x0
        struct {
            uint8_t version : 4;
            uint8_t length : 4;
        };
    };
    uint8_t type_of_service; // 0x1
    uint16_t total_length; // 0x2
    uint16_t id; // 0x4
    union {
        uint16_t offset; // 0x6
        struct {
            uint16_t __zero : 1;
            uint16_t dont_fragment : 1;
            uint16_t more_fragments : 1;
            uint16_t fragment_offset : 13;
        };
    };
    uint8_t time_to_live; // 0x8
    uint8_t protocol; // 0x9
    uint16_t checksum; // 0xA
    in_addr source; // 0xC
    in_addr destination; // 0x10
    // 0x14
};

// size: 0x28
struct IPv6Header {
    union {
        uint32_t first_dword; // 0x0
        struct {
            uint32_t version : 4;
            uint32_t traffic_class : 8;
            uint32_t flow_label : 20;
        };
    };
    uint16_t payload_length; // 0x4
    uint8_t next_header; // 0x6
    uint8_t hop_limit; // 0x7
    in6_addr source; // 0x8
    in6_addr destination; // 0x18
    // 0x28
};

// size: 0x8
struct ICMPHeader {
    uint8_t type; // 0x0
    uint8_t subtype; // 0x1
    uint16_t checksum; // 0x2
    union {
        uint32_t header_data; // 0x4
        struct {
            uint16_t id; // 0x4
            uint16_t sequence_number; // 0x6
        } ping;
    };
    // 0x8
};

enum SocketType : uint8_t {
    TCP,
    UDP,
    ICMP
};

static inline constexpr bool is_ipv6_compatible_with_ipv4(const IP6_ADDRESS& addr) {
    return addr.IP6Dword[0] == 0 && addr.IP6Dword[1] == 0 && addr.IP6Dword[2] == 0xFFFF0000;
}

static inline constexpr IP6_ADDRESS map_ipv4_to_ipv6(IP4_ADDRESS addr) {
    return (IP6_ADDRESS) {
        .IP6Dword = {
            0x00000000, 0x00000000, 0xFFFF0000, addr
        }
    };
}

static inline constexpr IP6_ADDRESS map_ip_to_ipv6(const sockaddr* addr) {
    switch (addr->sa_family) {
        case AF_INET:
            return map_ipv4_to_ipv6(*(const IP4_ADDRESS*)&((const sockaddr_in*)addr)->sin_addr);
        case AF_INET6:
            return *(const IP6_ADDRESS*)&((const sockaddr_in6*)addr)->sin6_addr;
        [[unlikely]] default:
            return {};
    }
}

static inline constexpr bool map_ipv6_to_ipv4(const IP6_ADDRESS& addr, IP4_ADDRESS& out) {
