#if __INTELLISENSE__
#undef _HAS_CXX20
#define _HAS_CXX20 0
#endif

#include <stdlib.h>
#include <stdint.h>
#include <string.h>
#include <stdio.h>
#include <string>
#include <mutex>
#include <charconv>
#include <system_error>
#include <bit>

#include <winsock2.h>
#include <ws2tcpip.h>
//#include <MSWSock.h>
#include <windns.h>

#include <ip2string.h>

#include "util.h"
#include "config.h"
#include "PatchUtils.h"
#include "AllocMan.h"
#include "log.h"
#include "netcode.h"
#include "lobby.h"

/*
template <typename T>
static inline size_t uint16_to_strbuf(uint16_t value, T* text_buffer) {
    size_t digit_offset;
    switch (value) {
        case 0 ... 9:
            digit_offset = 0;
            break;
        case 10 ... 99:
            digit_offset = 1;
            break;
        case 100 ... 999:
            digit_offset = 2;
            break;
        case 1000 ... 9999:
            digit_offset = 3;
            break;
        default:
            digit_offset = 4;
            break;
    }
    size_t ret = digit_offset + 1;
    do {
        uint16_t digit = value % 10;
        value /= 10;
        text_buffer[digit_offset] = ((T)'0') + digit;
    } while (digit_offset--);
    return ret;
}

template <typename T>
static inline size_t uint16_to_hex_strbuf(uint16_t value, T* text_buffer) {
    uint32_t temp = value;
    size_t digit_offset = temp ? 15 - std::countl_zero(value) >> 2 : 0;
    size_t ret = digit_offset + 1;
    do {
        uint16_t digit = temp & 0xF;
        temp >>= 2;
        text_buffer[digit_offset] = (digit < 10 ? (T)'0' : (T)('A' - 10)) + digit;
    } while (digit_offset--);
    return ret;
}

void print_ipv4(IP4_ADDRESS addr) {
    union {
        uint32_t temp;
        uint8_t as_bytes[4];
    };
    temp = addr;
    log_printf(
        "%u.%u.%u.%u"
        , as_bytes[0], as_bytes[1], as_bytes[2], as_bytes[3]
    );
}

void print_ipv6(const IP6_ADDRESS& addr) {
    log_printf(
        "%0hX:%0hX:%0hX:%0hX:%0hX:%0hX:%0hX:%0hX"
        , __builtin_bswap16(addr.IP6Word[0]), __builtin_bswap16(addr.IP6Word[1])
        , __builtin_bswap16(addr.IP6Word[2]), __builtin_bswap16(addr.IP6Word[3])
        , __builtin_bswap16(addr.IP6Word[4]), __builtin_bswap16(addr.IP6Word[5])
        , __builtin_bswap16(addr.IP6Word[6]), __builtin_bswap16(addr.IP6Word[7])
    );
}

template<typename T>
int sprint_ipv6(const IP6_ADDRESS& addr, T* buf) {
    T* buf_write = buf;
    buf_write += uint16_to_hex_strbuf(__builtin_bswap16(addr.IP6Word[0]), buf_write);
    *buf_write++ = (T)':';
    buf_write += uint16_to_hex_strbuf(__builtin_bswap16(addr.IP6Word[1]), buf_write);
    *buf_write++ = (T)':';
    buf_write += uint16_to_hex_strbuf(__builtin_bswap16(addr.IP6Word[2]), buf_write);
    *buf_write++ = (T)':';
    buf_write += uint16_to_hex_strbuf(__builtin_bswap16(addr.IP6Word[3]), buf_write);
    *buf_write++ = (T)':';
    buf_write += uint16_to_hex_strbuf(__builtin_bswap16(addr.IP6Word[4]), buf_write);
    *buf_write++ = (T)':';
    buf_write += uint16_to_hex_strbuf(__builtin_bswap16(addr.IP6Word[5]), buf_write);
    *buf_write++ = (T)':';
    buf_write += uint16_to_hex_strbuf(__builtin_bswap16(addr.IP6Word[6]), buf_write);
    *buf_write++ = (T)':';
    buf_write += uint16_to_hex_strbuf(__builtin_bswap16(addr.IP6Word[7]), buf_write);
    return buf_write - buf;
}

void print_sockaddr(const sockaddr* addr) {
    switch (addr->sa_family) {
        case AF_INET:
            print_ipv4(*(IP4_ADDRESS*)&((const sockaddr_in*)addr)->sin_addr);
            break;
        case AF_INET6:
            print_ipv6(*(IP6_ADDRESS*)&((const sockaddr_in6*)addr)->sin6_addr);
            break;
    }
}
*/

// size: 0x4F4
struct AsyncLobbyClient {

    void* vftable; // 0x0

    unsigned char __unknown_A[0x4]; // 0x4

    int __socket_state; // 0x8
    SOCKET lobby_tcp_socket; // 0xC

    unsigned char __unknown_B[0x104]; // 0x10

    uint32_t __uint_114; // 0x114
    SOCKET __socket_array_118[64]; // 0x118
    void* __innerA_ptr_218; // 0x218
    bool ssl_enabled; // 0x21C

    unsigned char __padding_A[0x3]; // 0x21D

    uint32_t __time_220; // 0x220

    unsigned char __unknown_C[0x4]; // 0x224

    long long __longlong_228; // 0x228
    long long __longlong_230; // 0x230
    std::string server_string; // 0x238
    std::string port_string; // 0x250
    //std::mutex __mutex_268; // 0x268
    unsigned char __mutex_dummy_268[0x30]; // 0x268

    unsigned char __dummy_A[0x40]; // 0x298

    std::string __last_host_used; // 0x2D8
    std::string lobby_prefix; // 0x2F0
    std::string current_nickname; // 0x308
    std::string __string_320; // 0x320
    std::string current_channel; // 0x338
    std::string __lobby_nameA; // 0x350
    std::string password; // 0x368
    std::string __lobby_nameB; // 0x380
    std::string version_signature; // 0x398
    std::string user_data_str; // 0x3B0 external_port as string
    std::string match_host; // 0x3C8
    std::string __match_user_data_str; // 0x3E0 opponent port?
    uint32_t local_port; // 0x3F8
    int __dword_3FC; // 0x3FC
    int __int_400; // 0x400
    int __int_404; // 0x404
    int __dword_408; // 0x408

    unsigned char __innerB_40C[0x8]; // 0x40C

    int __dword_414; // 0x414
    uint32_t __time_418; // 0x418
    int __dword_41C; // 0x41C
    bool __bool_420; // 0x420

    unsigned char __padding_B[0x3];// 0x421

    std::string __opponent_nickname; // 0x424
    bool __bool_43C; // 0x43C

    unsigned char __padding_C[0x3]; // 0x43D

    std::string __recv_str; // 0x440

    unsigned char __queue_458[0x18]; // 0x458

    unsigned char __unknown_D[0x7C]; // 0x470

    int __lobby_state; // 0x4EC
    int32_t max_nickname_length; // 0x4F0
    // 0x4F4
};

static_assert(sizeof(AsyncLobbyClient) == 0x4F8);
static_assert(__builtin_offsetof(AsyncLobbyClient, current_nickname) == 0x308);

static_assert(__builtin_offsetof(PacketLobbyName, type) == 0);

uintptr_t lobby_base_address = 0;

static SpinLock punch_lock;

static SOCKET punch_socket = INVALID_SOCKET;
static bool punch_socket_is_loaned = false;
static bool punch_socket_is_inherited = false;

static sockaddr_storage lobby_addr = {};
static sockaddr_storage local_addr = {};
static size_t lobby_addr_length = 0;
static size_t local_addr_length = 0;

static sockaddr_storage SENDTO_ADDR = {};
static sockaddr_storage RECVFROM_ADDR = {};
static int SENDTO_ADDR_LEN = 0;
static int RECVFROM_ADDR_LEN = 0;
static uint8_t SENDTO_TYPE = UINT8_MAX;
static uint8_t RECVFROM_TYPE = UINT8_MAX;

static void send_lobby_name_packet(SOCKET sock, const char* nickname, size_t length) {
