#if __INTELLISENSE__
#undef _HAS_CXX20
#define _HAS_CXX20 0
#endif

#include <stdlib.h>
#include <stdint.h>
#include <string.h>
#include <stdio.h>
#include <string>
#include <mutex>
#include <charconv>
#include <system_error>
#include <bit>

#include <winsock2.h>
#include <ws2tcpip.h>
//#include <MSWSock.h>
#include <windns.h>
#include <synchapi.h>

#include "util.h"
#include "config.h"
#include "patch_utils.h"
#include "alloc_man.h"
#include "log.h"
#include "netcode.h"
#include "lobby.h"

#define ONLY_LOG_CUSTOM_PACKETS 0

#if CONNECTION_LOGGING & CONNECTION_LOGGING_LOBBY_DEBUG
#define lobby_debug_printf(...) log_printf(__VA_ARGS__)
#else
#define lobby_debug_printf(...) EVAL_NOOP(__VA_ARGS__)
#endif

#if PUNCH_BOOST_TYPE & PUNCH_BOOST_PROCESS_PRIORITY
#define BOOST_PROCESS_PRIORITY_START() \
DWORD prev_process_priority = GetPriorityClass(CurrentProcessPseudoHandle()); \
SetPriorityClass(CurrentProcessPseudoHandle(), REALTIME_PRIORITY_CLASS)
#define BOOST_PROCESS_PRIORITY_END() SetPriorityClass(CurrentProcessPseudoHandle(), prev_process_priority)
#else
#define BOOST_PROCESS_PRIORITY_START() require_semicolon()
#define BOOST_PROCESS_PRIORITY_END() require_semicolon()
#endif

#if PUNCH_BOOST_TYPE & PUNCH_BOOST_THREAD_PRIORITY
#define BOOST_THREAD_PRIORITY_START() \
int prev_thread_priority = GetThreadPriority(CurrentThreadPseudoHandle()); \
SetThreadPriority(CurrentThreadPseudoHandle(), THREAD_PRIORITY_TIME_CRITICAL)
#define BOOST_THREAD_PRIORITY_END() SetThreadPriority(CurrentThreadPseudoHandle(), prev_thread_priority)
#else
#define BOOST_THREAD_PRIORITY_START() require_semicolon()
#define BOOST_THREAD_PRIORITY_END() require_semicolon()
#endif

#if PUNCH_BOOST_TYPE & PUNCH_BOOST_TIMER_PRECISION
static UINT minimum_timer_precision = 1;
#define BOOST_TIMER_PRECISION_START() timeBeginPeriod(minimum_timer_precision)
#define BOOST_TIMER_PRECISION_END() timeEndPeriod(minimum_timer_precision)
#else
#define BOOST_TIMER_PRECISION_START() require_semicolon()
#define BOOST_TIMER_PRECISION_END() require_semicolon()
#endif

#define PUNCH_BOOST_START() \
BOOST_PROCESS_PRIORITY_START(); \
BOOST_THREAD_PRIORITY_START(); \
BOOST_TIMER_PRECISION_START()

#define PUNCH_BOOST_END() \
BOOST_TIMER_PRECISION_END(); \
BOOST_THREAD_PRIORITY_END(); \
BOOST_PROCESS_PRIORITY_END()

#if !MINGW_COMPAT
#define SOCKADDR_IN4_LITERAL(ip, port) (sockaddr_in){ .sin_family = AF_INET, .sin_port = port, .sin_addr = ip }
#define SOCKADDR_IN6_LITERAL(ip, port) (sockaddr_in6){ .sin6_family = AF_INET6, .sin6_port = port, .sin6_addr = ip }
#else
#define SOCKADDR_IN4_LITERAL(ip, port) (sockaddr_in){ AF_INET, port, ip }
#define SOCKADDR_IN6_LITERAL(ip, port) (sockaddr_in6){ AF_INET6, port, 0, ip }
#endif

#define INIT_SOCKADDR_IN4(sockaddr, ip, port) \
PUSH_WARNINGS() \
IGNORE_DESIGNATED_INITIALIZER_WARNING() \
*(sockaddr_in*)&sockaddr = SOCKADDR_IN4_LITERAL(ip, port); \
POP_WARNINGS()

#define INIT_SOCKADDR_IN6(sockaddr, ip, port) \
PUSH_WARNINGS() \
IGNORE_DESIGNATED_INITIALIZER_WARNING() \
*(sockaddr_in6*)&sockaddr = SOCKADDR_IN6_LITERAL(ip, port); \
POP_WARNINGS()

// size: 0x4F4
struct AsyncLobbyClient {

    void* vftable; // 0x0

    unsigned char __unknown_A[0x4]; // 0x4

    int __socket_state; // 0x8
    SOCKET lobby_tcp_socket; // 0xC

    unsigned char __unknown_B[0x104]; // 0x10

    uint32_t __uint_114; // 0x114
    SOCKET __socket_array_118[64]; // 0x118
    void* __innerA_ptr_218; // 0x218
    bool ssl_enabled; // 0x21C

    unsigned char __padding_A[0x3]; // 0x21D

    uint32_t __time_220; // 0x220

    unsigned char __unknown_C[0x4]; // 0x224

    long long __longlong_228; // 0x228
    long long __longlong_230; // 0x230
    std::string server_string; // 0x238
    std::string port_string; // 0x250
    //std::mutex __mutex_268; // 0x268
    unsigned char __mutex_dummy_268[0x30]; // 0x268

    unsigned char __dummy_A[0x40]; // 0x298

    std::string __last_host_used; // 0x2D8
    std::string lobby_prefix; // 0x2F0
    std::string current_nickname; // 0x308
    std::string __string_320; // 0x320
    std::string current_channel; // 0x338
    std::string __lobby_nameA; // 0x350
    std::string password; // 0x368
    std::string __lobby_nameB; // 0x380
    std::string version_signature; // 0x398
    std::string user_data_str; // 0x3B0 external_port as string
    std::string match_host; // 0x3C8
    std::string __match_user_data_str; // 0x3E0 opponent port?
    uint32_t local_port; // 0x3F8
    int __dword_3FC; // 0x3FC
    int __int_400; // 0x400
    int __int_404; // 0x404
    int __dword_408; // 0x408

    unsigned char __innerB_40C[0x8]; // 0x40C

    int __dword_414; // 0x414
    uint32_t __time_418; // 0x418
    int __dword_41C; // 0x41C
    bool __bool_420; // 0x420

    unsigned char __padding_B[0x3];// 0x421

    std::string __opponent_nickname; // 0x424
    bool __bool_43C; // 0x43C

    unsigned char __padding_C[0x3]; // 0x43D

    std::string __recv_str; // 0x440

    unsigned char __queue_458[0x18]; // 0x458

    unsigned char __unknown_D[0x7C]; // 0x470

    int __lobby_state; // 0x4EC
    int32_t max_nickname_length; // 0x4F0
    // 0x4F4
};

static_assert(sizeof(AsyncLobbyClient) == 0x4F8);
static_assert(__builtin_offsetof(AsyncLobbyClient, current_nickname) == 0x308);

static_assert(__builtin_offsetof(PacketLobbyName, type) == 0);

static int init_sockaddr(sockaddr_storage& out, bool is_ipv6, const char* ip, uint16_t port) {
    if (!is_ipv6) {
        out.ss_family = AF_INET;
        ((sockaddr_in*)&out)->sin_port = hton(port);
        inet_pton(AF_INET, ip, &((sockaddr_in*)&out)->sin_addr);
        return sizeof(sockaddr_in);
    } else {
        out.ss_family = AF_INET6;
        ((sockaddr_in6*)&out)->sin6_port = hton(port);
        inet_pton(AF_INET6, ip, &((sockaddr_in6*)&out)->sin6_addr);
        return sizeof(sockaddr_in6);
    }
}

static u_long NON_BLOCKING_SOCKET = true;
static u_long BLOCKING_SOCKET = false;
template <bool state>
static inline bool set_blocking_state(SOCKET sock) {
    if constexpr (state) {
